"use strict";

(function() {
  var goodOptions = {
    NAME: [
      "Чесночные сливки",
      "Огуречный педант",
      "Молочная хрюша",
      "Грибной шейк",
      "Баклажановое безумие",
      "Паприколу итальяно",
      "Нинзя-удар васаби",
      "Хитрый баклажан",
      "Горчичный вызов",
      "Кедровая липучка",
      "Корманный портвейн",
      "Чилийский задира",
      "Беконовый взрыв",
      "Арахис vs виноград",
      "Сельдерейная душа",
      "Початок в бутылке",
      "Чернющий мистер чеснок",
      "Раша федераша",
      "Кислая мина",
      "Кукурузное утро",
      "Икорный фуршет",
      "Новогоднее настроение",
      "С пивком потянет",
      "Мисс креветка",
      "Бесконечный взрыв",
      "Невинные винные",
      "Бельгийское пенное",
      "Острый язычок"
    ],

    amount: {
      MIN: 0,
      MAX: 20
    },

    weight: {
      MIN: 10,
      MAX: 1000
    },

    price: {
      MIN: 10,
      MAX: 10000
    }
  };

  var goodRating = {
    value: {
      START: 1,
      FINISH: 5
    },
    number: {
      START: 10,
      FINISH: 900
    }
  };

  var nutritionFacts = {
    CONTENTS: [
      "молоко",
      "сливки",
      "вода",
      "пищевой краситель",
      "патока",
      "ароматизатор бекона",
      "ароматизатор свинца",
      "ароматизатор дуба, идентичный натуральному",
      "ароматизатор картофеля",
      "лимонная кислота",
      "загуститель",
      "эмульгатор",
      "консервант: сорбат калия",
      "посолочная смесь: соль, нитрит натрия",
      "ксилит",
      "карбамид",
      "вилларибо",
      "виллабаджо"
    ],
    sugar: true,
    energy: {
      START: 70,
      FINISH: 500
    }
  };

  var QUANTITY_GOODS = 26;

})();
